{
  "programming": [
    "Why do programmers prefer dark mode? Because light attracts bugs! 🐛",
    "Debugging: Removing the needles from the haystack.",
    "I told my computer I needed a break. Now it won't stop sending me Kit-Kats.",
    "Why do Java developers wear glasses? Because they can't C#.",
    "How many programmers does it take to change a light bulb? None, that's a hardware problem.",
    "Why was the JavaScript developer sad? Because he didn't know how to 'null' his feelings.",
    "What's a programmer's favorite hangout spot? The Foo Bar.",
    "Why do programmers confuse Halloween and Christmas? Because Oct 31 == Dec 25.",
    "How do you comfort a JavaScript bug? You console it.",
    "Why did the programmer quit his job? He didn't get arrays.",
    "What do you call a programmer from Finland? Nerdic.",
    "Why do programmers always mix up Christmas and Halloween? Because Dec 25 = Oct 31.",
    "What's the object-oriented way to become wealthy? Inheritance.",
    "Why did the developer go broke? He used up all his cache.",
    "How many programmers does it take to screw in a light bulb? None. It's a hardware problem.",
    "Why was the computer cold? It left its Windows open.",
    "What's a programmer's favorite snack? Cookies and cache.",
    "Why do Python programmers prefer snakes? Because they love indentation.",
    "What do you call a computer that sings? A Dell.",
    "Why don't programmers like nature? It has too many bugs."
  ],
  "crypto": [
    "I asked my crypto friend for investment advice. He said 'HODL'... I think he's cold.",
    "What's a cryptocurrency's favorite type of music? Block & roll!",
    "Why did the Bitcoin break up with the Ethereum? It found a better block.",
    "What do you call a cryptocurrency that tells jokes? A laughing stock.",
    "Why did the crypto investor cross the road? To HODL on the other side!",
    "How do you know you're at a crypto party? All the conversations are about blocks and chains.",
    "What did one blockchain say to another? 'I'm really into you, no miner what.'",
    "Why did the crypto trader go to therapy? He had too many emotional dips.",
    "What's a crypto enthusiast's favorite game? Token and seek.",
    "Why are crypto investors good at chess? They always think several blocks ahead.",
    "What do you call a scared cryptocurrency? A fraidcoin.",
    "Why did the Bitcoin go to school? To get smarter contracts.",
    "What's a crypto miner's favorite exercise? The blockchain.",
    "Why did the NFT break up with the DAO? It was too decentralized.",
    "What do you call a crypto party? A token gathering.",
    "Why was the crypto investor always calm? He had diamond hands.",
    "What's a crypto whale's favorite movie? Moby Bitcoin.",
    "Why did the crypto developer quit? He couldn't handle the forking pressure.",
    "What do you call a crypto that's always late? Tardycoin.",
    "Why don't crypto traders play hide and seek? Because good luck hiding when you're on a public ledger."
  ],
  "general": [
    "I'm reading a book on anti-gravity. It's impossible to put down!",
    "I told my wife she was drawing her eyebrows too high. She looked surprised.",
    "Why don't scientists trust atoms? Because they make up everything.",
    "I used to be a baker, but I couldn't make enough dough.",
    "What do you call a fake noodle? An impasta.",
    "Why did the scarecrow win an award? He was outstanding in his field.",
    "What do you call a bear with no teeth? A gummy bear.",
    "Why don't eggs tell jokes? They'd crack each other up.",
    "What do you call a dinosaur that crashes his car? Tyrannosaurus Wrecks.",
    "Why don't skeletons fight each other? They don't have the guts.",
    "What do you call cheese that isn't yours? Nacho cheese.",
    "Why did the math book look so sad? It had too many problems.",
    "What do you get when you cross a snowman and a vampire? Frostbite.",
    "Why did the coffee file a police report? It got mugged.",
    "What do you call a sleeping bull? A bulldozer.",
    "Why don't scientists trust stairs? Because they're always up to something.",
    "What do you call a fish wearing a bowtie? Sofishticated.",
    "Why did the bicycle fall over? It was two tired.",
    "What do you call a factory that makes okay products? A satisfactory.",
    "Why did the stadium get hot after the game? All the fans left."
  ],
  "work": [
    "My boss told me to have a good day... so I went home.",
    "The first rule of work: If it's not in Slack, it didn't happen.",
    "Why do meetings exist? So minutes can be taken and hours wasted.",
    "I pretend to work as hard as my boss pretends to pay me.",
    "Work would be great if it weren't for all the customers.",
    "The best part of my job? The paycheck.",
    "Why did the employee bring a ladder to work? To climb the corporate ladder.",
    "My inbox is like a black hole - emails go in but never come out.",
    "Work-from-home is just being unemployed with extra steps.",
    "Why did the spreadsheet go to therapy? It had too many issues."
  ]
}
